---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletFailure
source: html/62dda055-42a5-72ff-6270-4e9b2e360a99.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailProfileLowerThanFilletFailure Property

Fillet cannot be created between rail segment since the radius is lower than the profile size.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailProfileLowerThanFilletFailure { get; }
```